# Пароль пользователя по умолчанию
# (При первом входе будет пароль необходимо изменить)
$userpass = "Ss12345678"
# Домен пользователя
$domain = "kontoso.com"
# Почтовый ящик, на который будет отправлено уведомление о миграции
$notify = "best@kontoso.com"
# =====================================================
# ! Меняйте только переменные, которые находятся выше !
# =====================================================

# тут ввод кредов



$FirstName = Read-Host "Имя: "
$LastName = Read-Host "Фамилия: "
$MiddleName = Read-Host "Отчество: "
$Division = Read-Host "Отдел: "
$Manager = Read-Host "Руководитель: "
$Title = Read-Host "Должность: "
$OfficePhone = Read-Host "Внутренний номер: "
$mail = $FirstName.ToLower() + "." + $LastName.ToLower() + "@" + $domain.ToLower()



# тут генерация почты и отображаемого имени



# тут коннект на AD с уточнением инфы



# тут подключение к Exchange Online для миграции ящика
